[
    {
        "Article URL": "https://inc42.com/startups/can-this-jaipur-based-startups-3-in-1-bladeless-fans-take-over-indian-homes/",
        "Title": "Can This Jaipur-Based Startup’s 3-In-1 Bladeless Fans Take Over Indian Homes?",
        "Author Name": "Pooja Y.",
        "Author URL": "https://inc42.com/author/pooja-yadav/",
        "Article Content": "The adoption of smart home technology in India is increasing, driven by factors such as technological advancements, enhanced consumer awareness, and a rise in disposable income and discretionary spending of individuals, just to count a few.  As more households embrace the convenience and efficiency of these devices, the Indian smart home market is expected to grow into a  $9.2 Bn  market opportunity by 2028, growing at a CAGR of 9.14%. Leading the charge in this space are players like Haier, Samsung, Crompton Greaves Consumer Electricals, and Havells Group, among others.  Not only this, the sector has also attracted significant investor interest. For instance, earlier this year, smart home automation startup Keus Smart Home raised   in a round led by OAKS Asset Management. Similarly, Aliste Technologies, another startup specialising in smart home solutions, secured $1 Mn in December last year.  Notably, Reliance Jio launched its   in August 2023 to offer users the luxury of having seamless control over their home appliances.  However, if we were to delve deeper into this segment, we would observe innovations such as bladeless fans, robotic vacuum cleaners, and smart air purifiers, which have started to gain significant traction. Notably, in this highly attractive market, there are players that have pushed the boundaries of innovation to completely transform the face of the smart home industry. One such example is Jaipur-based  , which has developed a versatile product that integrates a bladeless fan, air purifier, and chandelier into a single unit. Founded in 2021 by Karan Bansal and Tanya Goyal, KARBAN Envirotech is a consumer electronics brand that specialises in IoT-enabled, energy-efficient climate control solutions for modern homes.    “We couldn’t find any major players offering integrated solutions, like ours, in this space. There were many air purifier companies and a few manufacturers of bladeless fans. Recessed ceiling fans, often called caged fans, exist but have inadequate airflow and are less appealing. No one was combining a fan, air purifier, and chandelier into a single multi-utility product. Noticing this gap, we patented our product,” Bansal said. Currently, the consumer electronics brand sells its products via its website and on Amazon, which accounts for a majority of its sales. It also has a selective offline dealership process, with around 10 dealers in Pune, Bangalore, Hyderabad, Chennai, Coimbatore, and Jaipur. The startup currently offers six SKUs, including two prototypes of its 3-in-1 product: the Airzone and a more compact version, the Airzone Lite. According to the cofounders, the company sold over 1,000 products and achieved net sales of INR 1 Cr+ in FY24. So far, the startup has raised INR 9.3 Cr from All in Capital, Titan Capital, Rainmatter, Urban Company, and the JK family office. KARBAN’s story began with cofounder Bansal’s early fascination with mechanical engineering during his school time. Later, while studying mechanical engineering at IIT Guwahati, he developed a keen interest in aerodynamics and computational fluid dynamics (CFD). This led him to pursue his Master’s in aerospace engineering from Purdue University. After completing his education, he worked as a CFD research engineer in the US with Convergent Science, where he spent about six years (from 2015 to 2021). During this time, the cofounder worked on various advanced projects, including new compressors, rocket components, and battery cooling technologies. This was the first time Bansal realised the need to do something unique with CFD solutions. Therefore, he quit his job to focus on this technology.  However, along the way, witnessing several gaps in the consumer appliances market, he decided to use his expertise in aerospace, which led him to develop a bladeless fan. In 2021, Bansal began working on the first prototype of a bladeless fan. However, as he designed it, he realised it could be more than just a fan. He thought that instead of focussing on a single product, he should combine multiple functions into one device.  With this one device, he also aspired to achieve maximum space efficiency, reduce costs, and eliminate the need for separate devices.  This led him to create a product that combined a fan, air purifier, and chandelier into one unit, a feature that was relatively rare in the market. By November 2022, Bansal completed the first prototype, the Airzone. He spent the next 3-4 months refining the design to make it market-ready. The product was officially launched on Amazon in June 2023. In January 2024, they introduced the Airzone Lite, a smaller version of the Airzone. Notably, while Bansal started KARBAN’s journey in 2021 and officially registered the startup in December 2021, he commenced operations only in January 2023. “Before January 2023, the focus was on laying the groundwork, and the startup was not yet fully operational,” said the cofounder. The startup leverages Computational Fluid Dynamics (CFD) and aerospace engineering to optimise air circulation within a room. For context, CFD is a computer-based method for simulating and analysing fluid flow, including liquids, gases, and plasmas.  It uses complex mathematical equations to provide detailed insights into fluid behaviour. CFD is used in fields like aerospace engineering to optimise aerodynamics, weather forecasting to predict conditions, and visual effects to create realistic fluid simulations. By using CFD, the KARBAN team creates detailed computer models of prototypes to simulate performance, airflow, and purification before physical production. This approach allows for rapid adjustments and precise final designs. Moving on, the startup’s Airzone, installed on the ceiling, expands air inflow and boosts efficiency, serving as an alternative to traditional air purifiers and ceiling fans. Its bladeless design prioritises safety by reducing the risk of accidental injuries, while Forever Pure Technology stabilises AQI levels, providing continuous, high-quality air with minimal energy consumption.  Everything said and done, Bansal’s journey to KARBAN has not been easy. From building the hardware product to managing limited production and setting up a manufacturing unit, each step posed a significant challenge, the cofounder said. However, the hard work paid off, and in the first month of its operations, the startup generated around INR 3 Lakh in revenue, followed by INR 6 Lakh in the second month, INR 10 Lakh in the third, and INR 20 Lakh in the fourth month of operations.  “Our growth has been limited by production capacity. Due to the handcrafted nature of our products, we are unable to make more than 100 units a month. This is also the reason why our products are also priced higher than the ones that are mass-produced,” the founders said. The initial product line was made of wood because using plastic would have required an upfront investment of at least INR 3 to 4 Cr, which the startup didn’t have. “Figuring out how to manufacture with wood was a game-changer,” Bansal said. Another significant challenge was finding the right vendors. With small minimum order quantities (MOQs), the team faced high rates and resistance from vendors hesitant to work with smaller players. “It took a lot of convincing to get people on board,” Bansal said. Despite these hurdles,  the startup recently secured $1.07 Mn in seed funding , co-led by All in Capital, Titan Capital, and Rainmatter.   Besides, the cofounder is working on the next version of their product, which is expected to launch within the next four months.  “The main essence of the product will remain the same. But it will be an upgrade. A major upgrade on the current product. It will be made out of plastic,” said Bansal. The product, as per the founders, will be launched aligned with the startup’s sustainability goals. It will be available in two versions: one made entirely from recycled plastic for environmentally conscious consumers and another using 50% less plastic than existing products.  Additionally, in the short term, they plan to partner with distributors and dealers across India for offline expansion. In the medium term, the cofounders aim to scale production by 30 to 40 times. While the startup is currently on the right path, it will have to constantly evolve to introduce a new range of innovative products in the market. This becomes even more imperative as trends related to consumer electronics keep on changing every few years. Plus, the era of smart homes has just started, and to stay ahead in the race, a strong appetite for innovation will be the key to long-term survival.",
        "Published Date": "14th September, 2024"
    },
    {
        "Article URL": "https://inc42.com/features/indian-startup-fy24-financials-tracker-revenue-expense-loss-more/",
        "Title": "Indian Startup FY24 Financials Tracker: Tracking The Financial Performance Of Top Startups",
        "Author Name": "Team Inc42",
        "Author URL": "https://inc42.com/author/teaminc42/",
        "Article Content": "The world’s third largest startup ecosystem has been in the midst of a raging funding winter for a couple of years now. As investors tightened their purse strings, the Indian startup ecosystem has had to go through a lot of pain, which included thousands of employees losing their jobs.  This was especially true for the fiscal year 2023-24 (FY24), when the funding drought peaked. Far from the capital boom of 2021, when fear of missing out (FOMO) among investors drove a valuation bubble, FY23 and FY24 turned out to be a reality check for the startup ecosystem as many shut shop while others took the debt route to extend their runways.  However, not everything was doom and gloom. The struggle of the funding winter brought with it sanity in valuations and forced startups to cut their expenses to chart a profitable growth. This trend was evident in the financial statements of Indian startups in FY23 and seems to have continued in FY24 as well. Of the 42 startups that have released their financial statements for FY24 so far, 28 ended the year with profitable numbers. Their cumulative profit stood at INR 3,716.29 Cr.  The likes of Zomato, PB Fintech, Honasa and Milk Mantra turned profitable during the year under review. Meanwhile, the remaining 14 startups posted a cumulative loss of INR 6,094 Cr, with just Paytm and Ola Electric accounting for more than INR 3,000 Cr of this loss figure. However, it needs to be highlighted that many of these startups were also able to cut their losses in FY24. In terms of top line, the 42 startups posted a cumulative operating revenue of INR 1 Lakh Cr (INR 1,06,297.87 Cr to be precise) in the year ended March 2024.  So, without further ado, let’s take a look at the financial performance of some of these startups in FY24.  IPO-bound non-banking financial company Avanse Financial Services posted a profit of INR 342.4 Cr in FY24, a jump of 117% from INR 157.7 Cr in the previous fiscal year. Operating revenue also jumped 74.5% to INR 1,727 Cr in FY24 from INR 989.6 Cr in the previous year.  Its IPO will comprise a fresh issue of shares worth INR 1,000 Cr and an offer for sale (OFS) component of shares worth up to INR 2,500 Cr. It plans to use the IPO proceeds to increase its capital base to fuel further expansion of its business. IPO-Bound Avanse’s PAT Doubles To INR 342.4 Cr In FY24, Operating Revenue Surges 74% Coworking space startup Awfis managed to reduce its loss to INR 17.75 Cr in FY24, a 62% decline from INR 46.6 Cr in the previous year. Though the startup was in loss for the entire fiscal year, it turned profitable in Q4 FY24. It posted a profit of INR 1.4 Cr in Q4 FY24.  In terms of revenue, Awfis’ operating revenue jumped 55.6% to INR 848.8 Cr in FY24 from INR 545.2 Cr in the previous year. In Q4 FY24, the startup’s operating revenue jumped over 45% YoY to INR 232.4 Cr.  Awfis went public in May this year. Its IPO comprised a fresh issue of shares worth INR 128 Cr and an OFS component of up to 1.23 Cr shares. Peak XV Partners and Bisque Limited were among the investors who sold shares via the OFS.  Awfis Turns Profitable In Q4 With INR 1.4 Cr PAT, Operating Revenue Jumps 45% YoY IPO-bound BlackBuck managed to lower its loss by over 30% in the financial year ended March 31, 2024. The logistics startup incurred a net loss of INR 194 Cr, a decline of 33% from INR 290.4 Cr in the previous fiscal year.  The Flipkart-backed startup’s operating revenue zoomed 69% to INR 296.9 Cr in FY24 from INR 175.6 Cr in FY23. It primarily earns revenue by offering payments services, telematics, load marketplace, and vehicle financing services on its platform.  The logistics unicorn’s IPO will comprise a fresh issue of shares worth INR 550 Cr and an OFS component of up to 2.16 Cr shares (2,16,09,022 to be precise).  The Tata-owned omnichannel jewellery startup reported a 42% jump in its operating revenue to INR 3,080 Cr in FY24 from INR 2,169 Cr in the previous fiscal year.  However, net profit declined nearly 5% to INR 78.59 Cr during the under review from INR 82.08 Cr in FY23 due to rise in advertising and “miscellaneous” expenses.  Used car marketplace startup CarTrade saw its profit fall 50% to INR 20 Cr in FY24 from INR 40 Cr in the previous fiscal year. The decline in the loss could be attributed to the startup’s acquisition of Sobek Auto India, comprising OLX Autos C2B business and OLX classifieds business, for INR 535.54 Cr. CarTrade reported an operating revenue of INR 489.9 Cr in FY24 as against INR 363.7 Cr in the previous year.   CarTrade Back In The Black With INR 25 Cr PAT In Q4; Revenue Jumps 38% YoY Delhi NCR-based Delhivery posted a 75% decrease in its loss in FY24. The logistics unicorn reported a loss of INR 249 Cr during the year as against INR 1,007 Cr in FY23.  Operating revenue stood at INR 8,141 Cr in FY24, an increase of 12.6% from INR 7,225 Cr in the previous fiscal year.  The startup also reduced its advertising expenses to INR 16 Cr from INR 22 Cr in FY24.  After A Profitable Q3, Delhivery Posts INR 69 Cr Loss In Q4 FY24 Pune-based drone startup DroneAcharya Aerial Innovations reported a consolidated profit after tax (PAT) of INR 6.2 Cr in FY24, almost double of INR 3.42 Cr profit it posted in the previous fiscal year. DroneAcharya’s operating revenue increased nearly 90% to INR 35.19 Cr in FY24 from INR 18.56 Cr in FY23. The startup attributed this increase to the company’s steady and consistent growth as a drone solution provider and a drone training organisation. \n \n DroneAcharya’s Net Profit Doubles To INR 6.2 Cr In FY24, Operating Revenue Jumps 90% Online ticketing platform EaseMyTrip saw its revenue rise 32% to INR 591 Cr from INR 488.8 Cr in FY23, driven by an increase in sales of air tickets.  Despite the increase in revenue, the startup’s profit took a hit. EaseMyTrip’s profit fell 23% to INR 103.4 Cr in FY24 from INR 134 Cr in the previous fiscal year. Increase in advertising expenses was among the reasons for the decrease in profit. EaseMyTrip Q4: Incurs Loss Of INR 15 Cr Due To One-Time Expenses IPO-bound logistics startup Ecom Express managed to reduce its net loss by 67% to  INR 255.8 Cr in FY24 from INR 428.1 Cr in FY23. The startup’s operating revenue saw a marginal 2.15% increase to INR 2,609 Cr in FY24 from INR 2,553.9 Cr in the previous fiscal year, as per its DRHP. Total expenses rose marginally by 0.64% to INR 2,921.5 Cr in  FY24, from INR 2,902.8 Cr. \n \n Agritech startup Fasal’s revenue from operations grew 89% to INR 34.1 Cr in FY24 from INR 18 Cr in FY23. Including other income, Fasal’s total revenue grew nearly 90% to INR 35.5 Cr in FY24 from INR 18.8 Cr in the previous fiscal year. Meanwhile, total expenses rose 34% to INR 69.5 Cr during the year under review from INR 51.6 Cr in FY23.  Loss increased 6% to INR 34 Cr from INR 32 Cr in FY23.  Agritech Startup Fasal’s FY24 Revenue Jumps 89% to INR 34.1 Cr Mumbai-based Fino Payments Bank’s operating revenue jumped 20% to INR 1,478.3 Cr in FY24 from INR 1,229.9 Cr in the previous fiscal year.  Its expenses also grew almost in line with revenue. Total expenses stood at INR 1,391.5 Cr in FY24, up 19% from INR 1,164.8Cr in the previous fiscal year. Fino’s net profit zoomed 32% to INR 86.2 Cr from INR 65 Cr in FY23.  Fino Payments Bank Q4: Net Profit Rises 14% YoY To INR 25.21 Cr Ahead of its IPO, kids-focussed omnichannel retailer FirstCry managed to reduce its net loss by 34% to INR 321.5 Cr in FY24 from INR 486 Cr in the previous fiscal year. Its operating revenue increased 15% to INR 6,480.8 Cr during the year under review from INR 5,632.5 Cr in FY23. Expenses rose 9.2% to INR 6,896.6 Cr from INR 6,315.7 Cr in FY23.  FirstCry made its public market debut in August. Its shares listed at  INR 651 on the NSE, a premium of 40% over its issue price of INR 549 . FirstCry FY24: Loss Narrows 34%, Revenue Crosses INR 6K Cr Mark Ahead Of IPO Insurtech startup Go Digit posted strong results with a 400% jump in its profit after tax (PAT) to INR 182 Cr in FY24 from INR 36 Cr in the previous fiscal year. With the sharp growth in health, travel, and personal accident premiums, Go Digit’s total gross written premium (GWP) increased 24.5% to INR 9,016 Cr from INR 7,243 Cr in FY23. Net earned premium rose over 37% to INR 7,096 Cr in FY24 from INR 5,164 Cr in FY23. Go Digit FY24: PAT Jumps Over 5X To INR 182 Cr, GWP At INR 9,016 Cr Honasa Consumer Ltd, the parent entity of D2C unicorn Mamaearth, returned to the black during the year under review. After posting a net loss of INR 150.9 Cr in FY23, the startup minted a profit of INR 110.5 Cr in FY24.  Operating revenue rose 28.6% to INR 1,919.9 Cr from INR 1,492.7 Cr in FY23. Total expenditure jumped 21.3% to INR 1,822.4 Cr in FY24 from INR 1,501.6 Cr in the previous fiscal year. \n \n Honasa FY24: Mamaearth Parent Turns Profitable For Full Fiscal Year ideaForge reported its third consecutive profitable fiscal as the drone maker clocked a net profit of INR 47.8 Cr in the fiscal ended March 2024. This was an increase of almost 50% from INR 31.9 Cr. Its profit stood at INR 44 Cr in FY22.  Operating revenue also soared more than 70% year-on-year (YoY) to INR 186 Cr during the year under review. Meanwhile, expenses zoomed 81% to INR 282.9 Cr in FY24 from INR 155.6 Cr in the previous year.  ideaForge PAT Slips 30% QoQ To INR 10.3 Cr In Q4 The fintech startup’s operating revenue crossed the INR 1,000 Cr mark during the year under review. InCred saw its top line grow nearly 47% to INR 1,270 Cr in FY24 from INR 864.6 Cr in FY23. Meanwhile, profit soared 162% to INR 316.3 Cr from INR 120.9 Cr in FY23. Rising finance costs and employee benefit expenses pushed up InCred’s total expenses by over 37% YoY to INR 871.3 Cr during the fiscal year under review.  InCred FY24: Profit More Than Doubles To INR 316.3 Cr, Revenue Crosses INR 1,000 Cr Mark The B2B ecommerce major posted a 17% rise in its net profit to INR 334 Cr in FY24 from INR 283 Cr in the year-ago period.  Operating revenue jumped 21% to INR 1,196 Cr in the fiscal ended March 2024 from INR 985 Cr in FY23.  On similar lines, total expenses also rose 20% to INR 910.7 Cr in FY24 from INR 756.7 Cr in the previous fiscal year. This increase in expenditure was largely attributable to a sharp jump in employee benefit costs, which rose 27% YoY to INR 507 Cr during the year under review.  IndiaMART Q4: Profit Surges 78% YoY To INR 99.6 Cr Online travel aggregator ixigo had a bumper year as its net profit more than tripled to INR 73.1 Cr from INR 23.4 Cr in FY23.  The travel tech major’s operating revenue increased almost 31% to INR 655.9 Cr in the reported fiscal year from INR 501.2 Cr in FY23. This came largely on the back of broad-based growth across its business verticals and healthy uptick in annual active users.  Total expenditure jumped almost 30% YoY to INR 627.8 Cr in FY24. Le Travenues Technology, the parent company of the travel tech startup, made a stellar debut on the stock exchanges in June 2024 and listed at INR 138.10 per share on the BSE, a 48.5% premium from the issue price of INR 93.  ixigo FY24: Profit Jumps Over 200% To INR 73.1 Cr, Train Bookings Biggest Revenue Source Geotech company MapmyIndia reported a profit of INR 134.4 Cr in FY24, up 25% from INR 107.5 Cr in the previous fiscal year.  Operating revenue rose more than 34% to INR 379 in the year ended March 2024 from INR 281 Cr in FY23. Meanwhile, total expenditure increased 36% YoY to INR 240.9 Cr on the back of a sharp rise in other expenses, which rose 73%. :  MapmyIndia’s Q4 PAT Jumps 35% YoY To INR 38 Cr Bhubaneswar-based dairy tech startup Milk Mantra turned profitable in FY24, posting a net profit of INR 9.8 Cr as against a net loss of INR 12.3 Cr in the previous fiscal year. It is pertinent to note that the startup slipped into the red for the first time in FY23 after eight straight years of profitability.  Operating revenue stood at INR 276.4 Cr in FY24, a marginal increase of 1.3% from INR 272.9 Cr in FY23.   In terms of expenditure, the startup’s total cost fell a little over 7% to INR 269.1 Cr in FY24 from INR 289.5 Cr in the previous year.  Milk Mantra Back In The Black With INR 9.8 Cr Profit In FY24, But Growth Remains Muted Gaming major Nazara Technologies reported an operating revenue of INR 1,138.2 Cr during the year under review. This was an increase of 4.3% from INR 1,091 Cr in FY23.  Profit jumped 21.7% to INR 74.7 Cr from INR 61.3 Cr in the previous fiscal year.  Nazara’s total expenses stood at INR 1,112.4 Cr in FY24, an increase of 5.7% from INR 1,051.7 Cr in the previous fiscal year.  Nazara Q4: Profit Shrinks To INR 18 Lakh, Operating Revenue Declines To INR 266.2 Cr Fashion ecommerce startup Nykaa reported an operating revenue of INR 6,358.6 Cr in FY24, 23.6% higher than INR 5,143.8 Cr in the previous fiscal year.  Its profit increased 89.5% to INR 40 Cr in FY24 from INR 21.1 Cr in FY23.  The Falguni Nayar-led unicorn’s total expenditure grew 23.5% to INR 6,346.5 Cr in FY24 from INR 5,135.6 Cr in the previous fiscal year.  Nykaa FY24: Despite Q4 Slide, Profit Rises By 80% For Full Fiscal Year B2B marketplace OfBusiness’ consolidated operating revenue surged over 25% to INR 19,296.3 Cr FY24 from INR 15,342.6 Cr in the previous fiscal year. Net profit increased by over 30% to INR 602 Cr from INR 463 Cr in the previous fiscal year.  Total expenses jumped 24.3% to INR 18,695.7 Cr in FY24 from INR 15,037.5 Cr in the previous fiscal year. Recently listed two-wheeler EV startup Ola Electric reported a 90% jump in its revenue to INR 5,010 Cr in FY24 from INR 2,630 Cr in the previous year, on the back of increase in sales of its EV scooters.  The Bhavish Aggarwal-led startup also managed to cap the increase in loss ahead of its IPO. Its net loss rose 7% to INR 1,584.4 Cr in FY24 from INR 1,472 Cr  in the previous year . Employee benefit expenses increased to INR 439 Cr from INR 427 Cr in FY23.  Fintech unicorn Oxyzo,  led by couple Ruchi Kalra and  Asish Mohapatra, reported a 47% rise in profit to INR 290 Cr in FY24 from INR 198 Cr in the previous fiscal year.  Operating revenue zoomed 58% to INR 903.3 Cr from INR 569.9 Cr in FY23. Oxyzo primarily earns revenue from the interest it earns by offering loans to small and medium enterprises. Troubled fintech giant Paytm posted a revenue of INR 9,977.8 Cr in FY24, an increase of 24.8% from INR 7,990.3 Cr in the previous year. It also managed to narrow its loss by 19.3% to INR 1,422.4 Cr from INR 1,775.6 Cr in FY23.  However, it needs to be mentioned that the Vijay Shekhar Sharma-led company’s revenue is likely to take a hit in FY25 due to the RBI’s crackdown on  Paytm Payments Bank.  PB Fintech, the parent company of insurance tech platform PolicyBazaar, saw its revenue cross the INR 3,000 Cr mark in FY24. Its operating revenue rose 34.4% to INR 3,437.6 Cr during the year under review from INR 2,557.8 Cr in FY23.  The company also turned profitable, posting a profit of INR 64.61 Cr during the year under review compared to a loss of INR 487.9 Cr in FY23.  Traveltech company RateGain’s consolidated profit after tax jumped 114% to INR 146.3 Cr in FY24 from INR 68.4 Cr in FY23. Its operating revenue zoomed 69% to INR 957 Cr during the year under review from INR 565 Cr in FY23 Employee benefit expenses increased to INR 380 Cr from INR 252.7 Cr in FY23, indicating an increase in employee count.  Cloud kitchen unicorn Rebel Foods narrowed its net loss by 42% to INR 378.2 Cr in FY24 from  INR 656.5 Cr in the previous fiscal year . The Faasos-parent trimmed its loss on the back of an increase in its top line and controlled expenses. Rebel Foods’ operating revenue jumped 19% to INR 1,420.2 Cr in FY24 from INR 1,195.2 Cr in FY23. Total expenses increased marginally by 1.6% to INR 1,857 Cr from INR 1827 Cr in the previous fiscal year.  \n \n IPO-bound coworking space provider Smartworks’ net loss narrowed 51% to INR 49.8 Cr in FY24 from INR 101.02 Cr in the previous fiscal year. The startup, which recently filed its DRHP to raise over INR 550 Cr via its IPO, saw its operating revenue jump 46% to INR 1,039.4 Cr during the year under review from INR 711.4 Cr in FY23.  Total expenditure increased 34% to INR 1,180.7 Cr from INR 880.2 Cr in the previous fiscal year.  SaaS cybersecurity startup TAC Infosec reported a net profit of INR 6.33 Cr in the financial year 2023-24 (FY24), a 23% jump from INR 5.12 Cr in FY23.  Operating revenue rose 17% to INR 11.84 Cr during the year under review from INR 10.09 Cr in FY23. Total expenditure for the fiscal stood at INR 5.49 Cr, an increase of 10% from the INR 4.97 Cr in the previous fiscal year.  \n \n The Bengaluru-based startup’s net loss narrowed 75% to INR 313 Cr in FY24 from INR 1,254.8 Cr in the previous fiscal year.  The startup, which primarily earns revenue from sales of medicines, and offering lab and diagnostics test services, saw its operating revenue rise 21% to INR 1,967.7 Cr during the year under review from INR 1,627 Cr in FY23. It managed to cut its total expenditure by 20% to INR 2,302.7 Cr in FY24 from INR 2,893.6 Cr in the previous fiscal year. B2B travel portal TBO Tek, which made a strong market debut in 2024, reported a 35% increase in its net profit to INR 200 Cr in FY24 from INR 148.4 Cr in the previous fiscal year. Operating revenue jumped 31% to INR 1,392.8 Cr from INR 1,064 Cr in FY23.  Employee benefit expense rose to INR 277.3 Cr during the year under review from INR 228.3 Cr in FY23. TBO Tek made its public market debut in May . The stock listed at INR 1,426 on the NSE, a premium of 55% to its issue price of INR 920. Similarly, the stock listed at INR 1,380 on the BSE, a premium of 50% to its issue price. In what was a sombre fiscal for Tracxn, the market intelligence platform saw its net profit shrink by more than 80% to INR 6.5 Cr in FY24 from INR 33 Cr in the year-ago period.  Tracxn’s operating revenue rose nearly 6% to INR 82.70 Cr during the year under review from INR 78.10 Cr in FY23. The fintech SaaS company’s net profit zoomed 210% to INR 12.5 Cr in FY24 from INR 4 Cr in the previous fiscal year, on the back of a healthy growth in its top line. The company, which made its public market debut in April 2024, saw its operating revenue jump 55.4% YoY to INR 35 Cr during the fiscal year ended March 2024. The IPO-bound D2C meat delivery startup reported a 70% jump in its net profit to INR 4.7 Cr during the fiscal ended March 2024 from INR 2.7 Cr in FY23.  As per its draft red herring prospectus (DRHP), Zappfresh’s operating revenue zoomed over 60% to INR 90.4 Cr in FY24 from INR 56.3 Cr in the previous fiscal year. ",
        "Published Date": "14th September, 2024"
    },
    {
        "Article URL": "https://inc42.com/buzz/ather-energy-fy24-revenue-declines-on-reduction-in-fame-ii-subsidy-loss-up-23-to-inr-1060-cr/",
        "Title": "Ather Energy FY24: Revenue Declines On Reduction In FAME-II Subsidy, Loss Up 22% To INR 1,060 Cr",
        "Author Name": "Akshit P.",
        "Author URL": "https://inc42.com/author/akshit-pushkarna/",
        "Article Content": "IPO-bound electric two-wheeler player Ather Energy’s operating revenue declined 1.5% year-on-year (YoY) to INR 1,753.8 Cr in the financial year 2023-24 (FY24), while net loss widened over 22% to INR 1,059.7 Cr. As per the company’s  DRHP filed with SEBI for more than INR 3,100 Cr IPO , Ather’s top line was hurt by the reduction in FAME subsidy provided by the government. In FY23, Ather’s operating revenue had seen a sharp 335% YoY jump to INR 1,780.9 Cr. In line with the EV startup’s growth, its net loss also widened 2.5X YoY to INR 864.5 Cr. On the reduction in revenue, Ather said in the DRHP, “Government of India has in the past recalled and scaled back, and may in the future recall or scale back, the benefits available to EV manufacturers under its schemes, increasing the costs borne by EV manufacturers. For example, pursuant to a notification dated May 19, 2023 from the Ministry of Heavy Industries, Government of India, the cap on incentives for the FAME scheme was scaled back from INR 15,000 per kWh to INR 10,000 per kWh, with effect from June 1, 2023. As a result of the reduced subsidy, our customers faced an increase in the retail price of our E2Ws ranging from INR 20,434 to INR 30,285. This contributed to a slight decrease in our revenue from operations.”  Founded in 2013 by Tarun Mehta and Swapnil Jain, Ather is one of the leading Indian two-wheeler EV manufacturers. It also manufactures its own battery packs and operates its own charging network. After building its market on its 450 series of escooters, which comprises Ather 450S, Ather 450X, and Ather 450 Apex, the startup recently launched a family escooter series Rizta and also forayed into the smart helmet category. Ather’s first model, Ather 450X – with its three variants – was the biggest contributor to the revenue in FY24. The total revenue generated by this series of vehicles stood at INR 1,283.8 Cr. In that, Ather 450X with 2.9 kWh capacity contributed 9% to the total operating revenue and Ather 450X with 3.7 kWh capacity contributed 31%. Meanwhile, the startup generated INR 277.7 Cr in revenue from Ather 450S and INR 9.1 Cr from Ather 450 Apex. In FY24, Ather sold 22,712 units of its Ather 450S, 86,315 units of 450X and 550 units of Ather 450 Apex. Ather Rizta’s deliveries began in the current fiscal year, from May 2024.  While Ather’s sale of finished goods, comprising its escooters, increased in FY24, the sale of its stock-in-trade, comprising EV-related accessories, spare parts and merchandise plummeted almost 76% YoY. The EV major’s sale of services, which it primarily derives from the sales of Pro Pack, which consists of Atherstack features, three years of access to Ather Connect features and the extended battery warranty, saw almost a 15% YoY decline during the year under review. Ather’s total expenses in FY24 stood at INR 2,674.2 Cr, rising marginally from INR 2,666.3 Cr in the previous year. The EV OEM spent the largest portion of its total expenses under this head, which increased 2.7% YoY to INR 1,579.2 Cr in FY24. It comprised raw materials and components Ather buys from its vendors for use in the manufacturing of scooters. Besides, it outsources manufacturing of components like chassis, battery management system (BMS), vehicle control unit, motor controller, and raw materials. Ather’s total employee benefit expenses rose 10.3% to INR 369.2 Cr in FY24 from INR 334.8 Cr in the previous year. The company had 1,458 on-roll employees and 996 off-roll employees as on March 31, 2024. Ather’s expenses under this bucket declined a massive 55% to INR 90.7 Cr during the year under review from INR 203.8 Cr in FY23. The startup said that this reduction in marketing efforts was mainly done to optimise  marketing spends, foreseeing a slowdown in consumer demand given the reduction of regulatory incentives under FAME-II. Ather’s expenditure here increased to INR 236.5 Cr in FY24 from INR 191.6 Cr in the previous fiscal year. As per Ather’s DRHP submitted on Monday (September 9), its IPO will comprise INR 3,100 Cr worth of fresh issue and an OFS component of 2.2 Cr equity shares. Cofounders Mehta and Jain will be offloading 10 Lakh shares each as part of the OFS. Among the other selling shareholders are Caladium Investments, National Investment and Infrastructure Fund II, and Tiger Global’s Internet Fund III. Hero MotoCorp, the biggest shareholder in Ather, will not sell any stake in the IPO. Ather’s IPO comes on the heels of its competitor Ola Electric going public by raising over INR 6,145.6 Cr in total.  Like Ola, Ather is also going public as a loss-making entity with no clear path projected to profitability.  In fact, the recently turned unicorn said in its DRHP that its ability to achieve profitability, positive cash flows from operating activities and a net working capital surplus will depend on factors like cost control, increasing sales of escooters in India, Nepal, and Sri Lanka and any other international markets. Recently, Ather expanded its business to Sri Lanka, marking its second overseas foray after Nepal. “We cannot assure you that our expansion into international markets will be profitable, nor can we guarantee that our products can be sold at favourable margins,” the EV major said.",
        "Published Date": "14th September, 2024"
    },
    {
        "Article URL": "https://inc42.com/features/swiggy-litmus-test-ipo-food-delivery-quick-commerce/",
        "Title": "Swiggy’s Litmus Test",
        "Author Name": "Team Inc42",
        "Author URL": "https://inc42.com/author/teaminc42/",
        "Article Content": "Swiggy",
        "Published Date": "14th September, 2024"
    },
    {
        "Article URL": "https://inc42.com/startups/can-newtrace-turbocharge-indias-push-for-green-hydrogen-dominance/",
        "Title": "Can Newtrace Turbocharge India’s Push For Green Hydrogen Dominance?",
        "Author Name": "Pooja Y.",
        "Author URL": "https://inc42.com/author/pooja-yadav/",
        "Article Content": "Green hydrogen, often called the fuel of the future, is quickly becoming a reality across the globe. India, too, is working to keep up with the shift towards alternative fuels.  Amid this, green hydrogen is being touted to have a wide range of applications, from road transport and aviation to industrial processes. For the uninitiated, green hydrogen is produced using renewable energy sources, like wind and solar power, to split water into hydrogen and oxygen through electrolysis. The result is hydrogen without a carbon footprint, with water as the only by-product. While hydrogen research began in the 19th century, practical applications didn’t take off globally until the 20th century.  The focus on green hydrogen is a more recent development, driven by the worldwide push to lower CO2 emissions and meet net-zero targets. With India aiming to achieve net-zero emissions by 2050, the government approved  The mission aims to develop the capacity to produce at least 5 Mn metric tonnes (MMT) of green hydrogen annually by 2030. Sensing the shift in the global energy market, Bengaluru-based cleantech startup   has entered the scene at just the right time. Founded in 2021 by Prasanta Sarkar and Rochan Sinha, Newtrace has built an electrolyser technology that can enable green hydrogen production and its application at a lower cost. While a few other top conglomerates, including Adani Group, Reliance, and L&T Electrolysers, are also aiming to build green hydrogen electrolysers, Newtrace claims that its proprietary, patent-pending membrane-less electrolyser technology gives almost 99.9% pure hydrogen at the lowest capex (60% reduced cost). It is pertinent to mention that if the startup can maintain this benchmark while scaling up, it could become one of the leading names in the country’s domestic hydrogen market, as well as the export market, in the coming years. Also worth mentioning is the fact that the global demand for green hydrogen is expected to cross the 100 MMT mark by 2030. Sarkar and Sinha, both PhD scholars from prestigious global universities, had no intention of settling in India. However, when the first wave of the Covid-19 pandemic hit in 2020, they found themselves stuck in the country. As fate would have it, they eventually crossed paths for the first time at an event organised by Entrepreneur First in Bengaluru.  The scholar duo synced on the fact that both were driven by the motivation of tackling climate change problems. However, riding the trend of India’s IT services market, the two started working on building a software company, a material informatics platform. Within a year, the duo chose to pursue their true calling and started working on the electrolyser technology for green hydrogen in June 2021. After building the technology, they incorporated Newtrace in October 2021.  “When we started building our first electrolyser from our apartment in Bengaluru, everybody had only heard about hydrogen from Elon Musk, and the first question was  Gaadi kitni kilometres chalegi?  (How much mileage can hydrogen cars give?),” cofounder and CEO Sarkar said.  He, however, added that they were looking beyond mobility. “We were looking at applications at refineries — for the processing of steel or cement, and ammonia for fertilisers.” There were not only misconceptions and a lack of knowledge around the role of hydrogen as a molecule but also inhibitions around a startup’s ability to enter this space, he added. By the end of 2021, the Newtrace founders found their first home in IIT Madras. After doing a proof of concept (PoC) for its first electrolyser, MARK 1, Newtrace started working on a lab prototype of the electrolyser with the help of Dr Satyanarayanan Chakravarthy at the university. Since then, there has been no looking back. In the last three years, the startup has made significant progress in coming out with three versions of its electrolysers — MARK 2 (a 1kW stack), MARK 3 (a 10-100 kW fully automated system), and MARK 4 (a 100-500 kW system). For context, a 10 kW electrolyser produces around 4 kg of hydrogen per day. Notably, the startup’s MARK 4, with a 10 kW stack (which can be increased to 500 kW as per requirement), is already being piloted by Bharat Petroleum Corporation Ltd. (BPCL). Sarkar explained that there is a growing demand among refineries for hydrogen to process crude oil. Besides, everybody in the oil and gas industry is looking to produce hydrogen in a decentralised manner and then supply it as fuel for the next generation of mobility solutions, he said. Hence, Newtrace is currently looking to largely tap the players in the oil and gas industry. It is soon making its next commercial deployment with ONGC Energy Center. The startup is also exploring the deployment of its electrolysers in the steel sector. Sarkar believes that it will take long before hydrogen becomes popular in mobility; hence, it is not a major focus for the company yet. Helped by its innovation and technology, Newtrace has also garnered significant investor attention. It became a part of Peak XV’s Surge 09 cohort in 2023.  The startup  raised $5.65 Mn in its Seed funding round  from Peak XV, Aavishkaar Capital, Speciale Invest, Micelio Fund, and a few other angel investors last year. Besides, it’s also one of the beneficiaries of the Indian government’s production-linked incentive (PLI) for setting up 30 MW/year electrolyser manufacturing. It started generating operating revenue in FY24. So far, Newtrace has deployed and secured orders worth $300K.  Before we dive deeper, it’s important to understand that using hydrogen in industrial processes in India isn’t new. According to government data, around 5 MMT of grey hydrogen is used annually in the country, with 99% of it going towards petroleum refining and making ammonia for fertilisers. Grey hydrogen is produced by burning fossil fuels like natural gas and coal. A report by the International Renewable Energy Agency (IRENA) showed that by the end of 2021, about 47% of global hydrogen production came from natural gas, 27% from coal, 22% from oil (as a by-product), and only 4% was made using electrolysis. One of India’s key goals in its Green Hydrogen Mission is to replace grey hydrogen with green hydrogen to lower carbon emissions and reduce reliance on fossil fuels. However, the high cost is a major obstacle. Newtrace’s technology aims to solve this. While traditional electrolysers (such as alkaline water, anion exchange membrane, proton exchange membrane, and solid oxide electrolysers) cost between $1,200 to $3,000 per kW, Newtrace’s membrane-less electrolyser brings that down to just $1,000 per kW. While Newtrace develops its own electrocatalyst, different vendors manufacture the other parts of the electrolyser based on Newtrace’s design. The final assembly is done by Newtrace, with each electrolyser costing between INR 1 Cr and INR 3 Cr, depending on its size. As the startup’s commercial deployments pick up pace, it is now focussing on larger industrial applications with mega-sized electrolysers rather than smaller projects.  The startup is building a 1 MW electrolyser system, which it plans to start deploying early next year, followed by even larger units, which will include 5 MW and 10 Mw systems. Soon, as the company scales and with the PLI in place, it will have a capacity of 30 MW per year. To support this growth, the founders are planning to set up a new manufacturing facility in Bengaluru next year, which will enable large-scale production of electrolysers. In addition to this, the startup is looking at global expansion starting next year.  “There’s a lot of appetite in the Middle East for electrolysers and green hydrogen production. Then there are countries like Japan also that have started looking at it. We want to complete the development cycle and demonstration cycle in India first, and then go out to explore other geographies,” Sarkar said. To fund its global expansion and manufacturing, Newtrace has set its eyes on raising a “substantial amount” in the next six months.  However, the startup is currently faced with a few challenges, including reducing the current two- to three-month timeline for deploying commercial orders. Also, the cleantech startup could face headwinds from fluctuations in demand and rising competition from large enterprises.  For now, with access to India’s first industrial-scale demonstration of membrane-less electrolyser technology, can Newtrace lead India’s green hydrogen ambition?",
        "Published Date": "14th September, 2024"
    }
]